### Indexación de dataframes

La indexación nos permite seleccionar valores de una Serie o de un DataFrame.

Podemos seleccionar un solo valor o varios:

In [1]:
import numpy as np
import pandas as pd

Vamos a crear una lista y a seleccionar elementos de distintas maneras:

In [21]:
serie_pares = [x for x in range(20) if (x % 2)==0]
serie_pares

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

In [24]:
serie_pares[0]

0

In [25]:
serie_pares[0:5]

[0, 2, 4, 6, 8]

In [28]:
serie_pares[-1]

16

In [29]:
serie_pares[3:]

[6, 8, 10, 12, 14, 16, 18]

Vamos a crear un DataFrame y seleccionar distintos elementos:

In [33]:
numeros = pd.DataFrame({"pares" : list(range(0, 10, 2)),
             "impares" : list(range(1, 10, 2))})

numeros

   pares  impares
0      0        1
1      2        3
2      4        5
3      6        7
4      8        9

Indexación mediante clave

In [32]:
numeros.pares

0    0
1    2
2    4
3    6
4    8
Name: pares, dtype: int64

Indexación directa

In [16]:
numeros['pares']

0    0
1    2
2    4
3    6
4    8
Name: pares, dtype: int64

In [17]:
numeros[['pares']]

   pares
0      0
1      2
2      4
3      6
4      8

**Indexación mediante método .loc[]**

Con el método .loc podemos seleccionar una fila, una columna, un valor o un rango de valores usando claves

In [34]:
dataframe = pd.DataFrame(np.arange(16).reshape(4, 4),
                         index=['f1', 'f2', 'f3', 'f4'],
                         columns=['c1','c2','c3','c4'])
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
dataframe.loc['f1']

c1    0
c2    1
c3    2
c4    3
Name: f1, dtype: int32

In [ ]:
dataframe.loc[:, 'c1']

f1     0
f2     4
f3     8
f4    12
Name: c1, dtype: int32

In [ ]:
dataframe.loc['f1', 'c1']

0

**Con el método .iloc[] indexamos usando enteros**

In [ ]:
dataframe.iloc[1]

c1    4
c2    5
c3    6
c4    7
Name: f2, dtype: int32

In [ ]:
dataframe.iloc[:, 1]

f1     1
f2     5
f3     9
f4    13
Name: c2, dtype: int32

In [ ]:
dataframe.iloc[1:3, 2:4]

    c3  c4
f2   6   7
f3  10  11

**Indexación mediante filtros booleeanos**

In [36]:
numeros.pares > 2

0    False
1    False
2     True
3     True
4     True
Name: pares, dtype: bool

In [37]:
numeros[numeros.pares>2]

   pares  impares
2      4        5
3      6        7
4      8        9

In [39]:
numeros.iloc[1:4, :][numeros.pares>2]

/tmp/ipykernel_6235/3341242192.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  numeros.iloc[1:4, :][numeros.pares>2]

   pares  impares
2      4        5
3      6        7

### Asignación en pandas

Podemos asignar valores a columnas, filas o celdas individuales

In [ ]:
numeros['primos'] = [1, 3, 5 ,7, 11]
numeros

   pares  impares  primos
0      0        1       1
1      2        3       3
2      4        5       5
3      6        7       7
4      8        9      11

In [ ]:
numeros.iloc[1,2]=0
numeros

   pares  impares  primos
0      0        1       1
1      2        3       0
2      4        5       5
3      6        7       7
4      8        9      11

In [ ]:
numeros[numeros.pares>2]=-1
numeros

   pares  impares  primos
0      0        1       1
1      2        3       0
2     -1       -1      -1
3     -1       -1      -1
4     -1       -1      -1

### Borrar columnas

In [ ]:
del numeros['primos']
numeros

   pares  impares
0      0        1
1      2        3
2     -1       -1
3     -1       -1
4     -1       -1

In [ ]:
numeros = numeros.iloc[:, :-1]
numeros

   pares
0      0
1      2
2     -1
3     -1
4     -1

In [ ]:
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
dataframe.drop('c1', axis=1)

    c2  c3  c4
f1   1   2   3
f2   5   6   7
f3   9  10  11
f4  13  14  15

In [ ]:
dataframe.drop('f1', axis=0)

    c1  c2  c3  c4
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [ ]:
dataframe.drop('c1', axis=1, inplace=True)
dataframe

    c2  c3  c4
f1   1   2   3
f2   5   6   7
f3   9  10  11
f4  13  14  15

___
# EJERCICIOS

**1** Leer los datos del fichero Fullmetadata.csv y almacenarlo en un DataFrame

**2** Elimina la columna games sin crear nuevo DataFrame

**3** Selecciona los jugadores del Aston Villa

**4** Selecciona los jugadores que hayan sido expulsados

**5** Selecciona los jugadores que hayan visto una tarjeta amarilla pero no hayan sido expulsados